Revit 2027 API
IFCUserDefinedPropertySet.SetApplicableEntities Method
 Sets the list of IFC entities to which the property set is applicable.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetApplicableEntities(
	IList<string> applicableEntities
)
Public Sub SetApplicableEntities (
	applicableEntities As IList(Of String)
)
public:
void SetApplicableEntities(
	IList<String^>^ applicableEntities
)
member SetApplicableEntities :
        applicableEntities : IList<string> -> unit
Parameters
applicableEntities IList<String>
 The list of IFC entities to which the property set is applicable.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
IFCUserDefinedPropertySet Class
Autodesk.Revit.DB Namespace